------------------------------------------------------------------------数据类型------------------------------------------------------------------------------
-------------------------标量begin---------------------------
String  : ${String}
bytes   : ${Bytes}
Short   : ${Short}
Integer : ${Integer}
Long    : ${Long}
Float   : ${Float}
Double  : ${Double}
Char    : ${Char}
Date    : ${Date}
Null    : ${Null!"对于freeMarker来说，null和不存在的变量是一样的，这是一个默认值"}
<#--Boolean : ${Boolean}-->
Boolean 不支持直接输出,再看后续是否有其它方式

原生字符串：${r"$@#"}
-------------------------标量end---------------------------

-------------------------容器begin---------------------------


--------------------if指令---------------------------------
<#if Boolean>
    boolean 作为条件能正常使用
<#else>
         条件为false
</#if>
--------------------if指令---------------------------------

